using System;

namespace ConsoleAppGlaca14Exercices20
{
    //Нека е дадена библиотека с книги. Дефинирайте класове съответно
    //за библиотека и книга.Библиотеката трябва да съдържа име и списък
    //от книги. Книгите трябва да съдържат информация за заглавие, автор,
    //издателство, година на издаване и ISBN номер. В класа, който описва
    //библиотека, добавете методи за добавяне на книга към библиотеката,
    //търсене на книга по предварително зададен автор, извеждане на
    //информация за дадена книга и изтриване на книга от библиотеката.
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
