using System;

namespace ConsoleAppGlaca14Exercices25
{
    //Дефинирайте клас Fraction, който съдържа информация за рационал-
    //на дроб(например ¼, ½). Дефинирайте статичен метод Parse(), който
    //да опитва да създаде дроб от символен низ(например -3/4).
    //Дефинирайте подходящи свойства и конструктори на класа.Напишете
    //и свойство от тип Decimal, което връща десетичната стойност на дробта
    //(например 0.25).

    //Напишете клас с 2 private decimal полета, които пазят информация
    //съответно за числителя и знаменателя на дробта.Направете подхо-
    //дящи свойства, които да капсулират информацията на дробта.Освен
    //другите изисквания в задачата, предефинирайте по подходящ начин
    //стандартните за всеки обект функции: Equals, GetHashCode, ToString.
    class Fraction
    {
        private decimal chisletel = 1;
        private decimal znametel = 4;

        public static int Parse(int str);
    }
}
