using System;

namespace ConsoleAppGlava2Exercice4
{
    class Program
    {
        static void Main(string[] args)
        {
            //4. Инициализирайте променлива от тип int със стойност 256 в шестна-десетичен формат (256 е 100 в бройна система с основа 16).
            //4. Вижте секцията за целочислени литерали. За да преобразувате лесно числата в различна бройна система, използвайте вградения 
            //в Windows калкулатор. За шестнайсетично представяне на литерал използвайте префикса 0x.
            // '\u0000' стойност по подразбиране

            int exr1 = 0x100;
            Console.WriteLine(exr1);
            
            int exr = 0xf7;

            Console.WriteLine(exr);
        }
    }
}
